<template>
    <main>
        <UserNavbar />
        <div class="content">
            <router-view></router-view>
            <div class="bg-page rules-container">
                <RuleCard
                    v-for="(paragraph, index) in rules"
                    :key="index"
                    :title="paragraph.title"
                    :text="paragraph.text"/>
            </div>
        </div>
    </main>
</template>
    
<script>
    import UserNavbar from '../components/UserNavbar.vue';
    import RuleCard from '../components/RuleCard.vue';
    
    export default {
        name: 'GymRules',
        components: {
            UserNavbar,
            RuleCard,
        },
        data() {
            return {
                rules: [
                    {
                        title: "ΚΑΝΟΝΕΣ ΛΕΙΤΟΥΡΓΙΑΣ #FITMOTION",
                        text: "",
                    },
                    {
                        title: "",
                        text: "Η διάρκεια της προπόνησης είναι 60 ΛΕΠΤΑ από την προκαθορισμένη ώρα. Τυχόν αργοπορία δεν επιμηκύνει την διάρκεια της προπόνησης πέραν του προκαθορισμένου βάση προγράμματος.",
                    },
                    {
                        title: "",
                        text: "Αναπληρώσεις προπονήσεων θα γίνονται έως τρεις (3) το μέγιστο και θα πραγματοποιούνται μέσα στον ίδιο μήνα και όχι στον επόμενο, όταν υπάρχει διαθέσιμη ημερομηνία και ώρα.",
                    },
                    {
                        title: "",
                        text: "Αποφύγετε να φέρετε μαζί σας αντικείμενα μεγάλης αξίας, χρήματα, τιμαλφή. Χρησιμοποιήστε τα ντουλάπια για τη φύλαξη των προσωπικών σας αντικειμένων όσο βρίσκεστε στο χώρο και κλειδώστε πάντα το ντουλάπι με το κλειδί που σας παρέχεται. Σε περίπτωση απώλειας αντικειμένων από οποιοδήποτε χώρο, το FitMotion δεν φέρει ουδεμία ευθύνη.",
                    },
                    {
                        title: "",
                        text: "Η χρήση πετσέτας είναι υποχρεωτική κατά την άσκηση.",
                    },
                    {
                        title: "",
                        text: "Η διεύθυνση του γυμναστηρίου διατηρεί το δικαίωμα αλλαγής του ωραρίου λειτουργίας αλλά και των επιμέρους τμημάτων του.",
                    },
                    {
                        title: "",
                        text: "Κάθε μέλος υποχρεούται να συμπληρώσει τη υπεύθυνη δήλωση υγείας, ώστε να του επιτραπεί να γίνει μέλος. Το κάθε μέλος, με δική του αποκλειστική ευθύνη πρέπει να έχει επισκεφτεί καρδιολόγο ή/και παθολόγο πριν την εγγραφή του στο γυμναστήριο.",
                    },
                    {
                        title: "",
                        text: "Τα μέλη οφείλουν να επανατοποθετούν τον εξοπλισμό που έχουν χρησιμοποιήσει κατά τη διάρκεια της προπόνησής τους, στην αρχική θέση του.",
                    },
                    {
                        title: "",
                        text: "Η συμφωνηθείσα συνδρομή του μέλους προκαταβάλλεται απαραίτητα. Δόσεις σε πακέτα συνδρομής γίνονται μόνο σε εξαιρετικές περιπτώσεις. Το υπάρχον πακέτο συνδρομής, δε διακόπτεται και δε μεταφέρεται, εκτός αν υπάρχουν λόγοι υγείας που πιστοποιούνται από γιατρό ή κατόπιν συνεννόησης.",
                    },
                    {
                        title: "",
                        text: "Η συνδρομή πρέπει να καταβάλλεται εντός το αργότερο ΔΥΟ (2) ΗΜΕΡΩΝ από την ημερομηνία λήξης της, ώστε να υπάρχει δυνατότητα ενσωμάτωσης στο εβδομαδιαίο πρόγραμμα.",
                    },
                    {
                        title: "",
                        text: "Η επιχείρηση διατηρεί το δικαίωμα να βιντεοσκοπεί πλάνα μέσα στο χώρο όπως επίσης και φωτογραφίες, με σκοπό την προβολή της στα social media. Αν δεν επιθυμείτε να εμφανίζεστε παρακαλώ επικοινωνήστε με τη γραμματεία.",
                    },
                    {
                        title: "",
                        text: "Το FitMotion επιφυλάσσει τα δικαιώματά του σε περίπτωση που ένα μέλος δεν συμμορφώνεται κατ' επανάληψη με τους κανόνες ασφαλείας, υγιεινής και λειτουργίας να τερματίσει την συνδρομή του και να το αποβάλει.",
                    },
                ]
            };
        }
    };
</script>
    
<style scoped>
    @import '../styles/BackgroundImage.css'; 

    main {
        display: flex;
        flex-direction: column;
        min-height: 100vh;
        margin: 0;
    }

    .content {
        flex: 1;
        display: flex;
        flex-direction: column;
    }

    .rules-container {
        flex: 1;
        display: flex;
        flex-direction: column; 
        align-items: center; 
        padding: 20px;
        gap: 0px;
        position: relative;
    }

    .rules-container::before {
        content: '';
        display: block;
        height: 48px; 
    }

    @media (max-width: 600px) {
        .rules-container::before {
            height: 36px;
        }
    }
</style>